<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da06_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd  # DataFrame
import seaborn as sns  # 예제 데이터 프레임. 시각화.

In [2]:
print('pandas version:', pd.__version__)
print('seaborn version:', sns.__version__)

pandas version: 1.1.5
seaborn version: 0.11.1

# tips dataset

In [3]:
# seaborn 패키지의 tips 예제 데이터 셋을 로드
tips = sns.load_dataset('tips')
print(type(tips))

<class 'pandas.core.frame.DataFrame'>

*   tips 데이터 프레임의 row 개수, column 개수 출력

In [4]:
tips.shape

(244, 7)

*   tips 데이터 프레임의 컬럼 이름들을 출력

In [5]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

*   tips 데이터 프레임의 첫 5개 row를 출력

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
tips.loc[:4]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
tips.iloc[:5]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

*   tips 데이터 프레임의 마지막 5개 row를 출력

In [9]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [10]:
tips.iloc[-5:]

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [11]:
tips.loc[239:]  # tips.shape[0] - 5

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

*   tips 데이터 프레임에서 total_bill 컬럼의 평균, 표준편차, 최솟값, 최댓값, 중앙값을 출력

In [12]:
bill = tips['total_bill']  # tips.total_bill
type(bill)

pandas.core.series.Series

In [13]:
print('mean:', bill.mean())
print('standard deviation:', bill.std())
print('max:', bill.max())
print('min:', bill.min())
print('median:', bill.median())

mean: 19.785942622950824
standard deviation: 8.902411954856856
max: 50.81
min: 3.07
median: 17.795

*   total_bill이 최댓값인 row를 출력

In [14]:
# boolean indexing
# tips[tips.total_bill == bill.max()]
tips[tips['total_bill'] == bill.max()]  #> DataFrame

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

In [15]:
tips.iloc[170]  #> Series

total_bill     50.81
tip               10
sex             Male
smoker           Yes
day              Sat
time          Dinner
size               3
Name: 170, dtype: object

In [16]:
# fancy indexing: 인덱스 연산자([]) 안에 list, tuple, array, Series 등을 사용해서 indexing
tips.iloc[[170]]  #> DataFrame

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

In [17]:
tips.iloc[[bill.argmax()]]

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

*   total_bill이 최솟값인 row를 출력

In [18]:
# boolean indexing
# tips[tips['total_bill'] == tips['total_bill'].min()]
tips[tips.total_bill == tips.total_bill.min()]

    total_bill  tip     sex smoker  day    time  size
67        3.07  1.0  Female    Yes  Sat  Dinner     1

In [19]:
# fancy indexing
# tips.iloc[tips.total_bill.argmin()]  #> Series
tips.iloc[[tips.total_bill.argmin()]]  #> DataFrame

    total_bill  tip     sex smoker  day    time  size
67        3.07  1.0  Female    Yes  Sat  Dinner     1

*   숫자 타입 데이터 요약 - 기술 통계량(평균, 표준편차, 중앙값, 최솟값, 최댓값, 백분윗값)
*   카테고리 타입 데이터 요약 - 빈도수(frequency)

In [20]:
tips['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [21]:
tips.time.value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [22]:
tips.describe()  #> 숫자 타입 변수(컬럼)들의 기술 통계량 요약.

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

*  일요일의 tip의 평균

In [23]:
# 1) tips에서 day=='Sun'인 레코드
sunday = tips[tips['day'] == 'Sun']
sunday

     total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3
187       30.46  2.00    Male    Yes  Sun  Dinner     5
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
190       15.69  1.50    Male    Yes  Sun  Dinner     2

[76 rows x 7 columns]

In [24]:
# 2) 1에서 찾은 데이터 프레임에서 tip 컬럼의 평균
sunday['tip'].mean()

3.255131578947369

In [25]:
tips[tips['day'] == 'Sun']['tip'].mean()

3.255131578947369

*   토요일의 tip의 평균

In [26]:
tips[tips.day == 'Sat'].tip.mean()

2.993103448275862

*   성별 tip의 평균: (1) 남성들의 tip 평균, (2) 여성들의 tip의 평균

In [27]:
tips[tips['sex'] == 'Male']['tip'].mean()

3.0896178343949052

In [28]:
tips[tips.sex == 'Female'].tip.mean()

2.833448275862069

In [29]:
tips.sex.unique()

['Female', 'Male']
Categories (2, object): ['Female', 'Male']

In [30]:
for gender in tips.sex.unique():
    print(f'{gender}: {tips[tips.sex == gender].tip.mean()}')

Female: 2.833448275862069
Male: 3.0896178343949052

*   일요일에 식사한 여성 손님의 tip의 평균

In [31]:
tips[(tips.day == 'Sun') & (tips.sex == 'Female')].tip.mean()

3.3672222222222223

*   일요일에 식사한 여성 비흡연자 손님의 tip의 평균

In [32]:
tips[(tips['day'] == 'Sun') &
     (tips['sex'] == 'Female') &
     (tips['smoker'] == 'No')]['tip'].mean()

3.329285714285714

# titanic dataset

In [45]:
# seaborn 패키지의 titanic 예제 데이터 셋을 로드
titanic = sns.load_dataset('titanic')
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [46]:
# titanic DF의 row/column 개수
titanic.shape

(891, 15)

In [47]:
# DF의 첫 6개 row를 출력
titanic.head(n=6)
# titanic.iloc[:6]
# titanic.loc[:5]

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True

[6 rows x 15 columns]

In [50]:
# DF의 마지막 6개 row를 출력
titanic.tail(n=6)
# titanic.iloc[-6:]
# titanic.loc[(titanic.shape[0] - 6):]

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[6 rows x 15 columns]

In [37]:
# DF의 컬럼 이름들을 출력

titanic 데이터 프레임의 컬럼(변수)

*   survived: 생존 여부(0: 사망, 1: 생존)
*   pclass: 객실 등급
*   sex: 성별
*   age: 나이

In [51]:
# 생존자, 사망자 숫자 출력
titanic['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [52]:
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [56]:
num_of_alive = titanic['survived'].value_counts().loc[1]
# num_of_alive = titanic['alive'].value_counts().loc['yes']
num_of_alive

342

In [58]:
titanic_survived = titanic[titanic['survived'] == 1]  # 생존자들로 이루어진 부분집합
len(titanic_survived)

342

In [61]:
# 남성 생존자, 여성 생존자 숫자, 비율 출력
#    남성 생존자 비율 = (남성 생존자 숫자) / (전체 생존자 숫자)
#    여성 생존자 비율 = (여성 생존자 숫자) / (전체 생존자 숫자)
gender = titanic_survived['sex'].value_counts()
print(gender)

num_of_female = gender.loc['female']
num_of_male = gender.loc['male']

print('남성 생존자 비율:', num_of_male / num_of_alive)
print('여성 생존자 비율:', num_of_female / num_of_alive)

female    233
male      109
Name: sex, dtype: int64
남성 생존자 비율: 0.31871345029239767
여성 생존자 비율: 0.6812865497076024

In [66]:
num_of_male_alive = len(titanic[(titanic['survived'] == 1) & (titanic['sex'] == 'male')])
num_of_female_alive = len(titanic[(titanic.survived == 1) & (titanic.sex == 'female')])
print('남성 생존자:', num_of_male_alive)
print('여성 생존자:', num_of_female_alive)

남성 생존자: 109
여성 생존자: 233

In [68]:
# 남자 승객 중 생존자 비율 = (남성 생존자 숫자) / (남성 승객 숫자)
# 여자 승객 중 생존자 비율 = (여성 생존자 숫자) / (여성 승객 숫자)
num_of_male = len(titanic[titanic.sex == 'male'])
num_of_female = len(titanic[titanic.sex == 'female'])

print('남성 생존 비율:', num_of_male_alive / num_of_male)
print('여성 생존 비율:', num_of_female_alive / num_of_female)

남성 생존 비율: 0.18890814558058924
여성 생존 비율: 0.7420382165605095

In [72]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [79]:
# 객실 등급별 생존자 숫자, 비율
#   1등급 객실 생존자 비율 = (1등급 객실 생존자 숫자) / (전체 생존자 숫자)
#   ...
s = titanic_survived.pclass.value_counts()
print(s)

num_of_class1_alive = s.loc[1]
num_of_class2_alive = s.loc[2]
num_of_class3_alive = s.loc[3]

print('1등급 객실 생존자 비율:',  num_of_class1_alive / num_of_alive)
print('2등급 객실 생존자 비율:',  num_of_class2_alive / num_of_alive)
print('3등급 객실 생존자 비율:',  num_of_class3_alive / num_of_alive)

1    136
3    119
2     87
Name: pclass, dtype: int64
1등급 객실 생존자 비율: 0.39766081871345027
2등급 객실 생존자 비율: 0.2543859649122807
3등급 객실 생존자 비율: 0.347953216374269

In [82]:
# 1등급 승객들 중 생존자 비율 = (1등급 객실 생존자 숫자) / (1등급 객실 승객 숫자)
# ...
# 객실 등급별 승객 숫자
num_of_class1 = titanic.pclass.value_counts().loc[1]
num_of_class2 = titanic.pclass.value_counts().loc[2]
num_of_class3 = titanic.pclass.value_counts().loc[3]

print('1등급 승객들 중 생존 비율:', num_of_class1_alive / num_of_class1)
print('2등급 승객들 중 생존 비율:', num_of_class2_alive / num_of_class2)
print('3등급 승객들 중 생존 비율:', num_of_class3_alive / num_of_class3)

1등급 승객들 중 생존 비율: 0.6296296296296297
2등급 승객들 중 생존 비율: 0.47282608695652173
3등급 승객들 중 생존 비율: 0.24236252545824846

In [84]:
len(titanic[titanic.pclass == 1])

216